Revit 2027 API
Rebar.HasVariableLengthBars Property
 Identifies if a set has varying length bars or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasVariableLengthBars { get; }
Public ReadOnly Property HasVariableLengthBars As Boolean
	Get
public:
property bool HasVariableLengthBars {
	bool get ();
}
member HasVariableLengthBars : bool with get
Property Value
Boolean
Remarks
 This function internally compares the bar lengths, so to have an accurate result the document should be regenerated before calling it.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace